---
kind: property
id: P:Autodesk.Revit.DB.FabricationAncillaryUsage.AncillaryWidthOrDiameter
source: html/e0ef9b2e-d4f2-f1d8-f06e-e2fd8f00bc06.htm
---
# Autodesk.Revit.DB.FabricationAncillaryUsage.AncillaryWidthOrDiameter Property

Width or diameter of required ancillary.

## Syntax (C#)
```csharp
public double AncillaryWidthOrDiameter { get; }
```